Revit 2027 API
FabricSheet.PlaceInHost Method
 Inserts the single Fabric Sheet instance into the host element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void PlaceInHost(
	Element hostElement,
	Transform transform
)
Public Sub PlaceInHost (
	hostElement As Element,
	transform As Transform
)
public:
void PlaceInHost(
	Element^ hostElement,
	Transform^ transform
)
member PlaceInHost :
        hostElement : Element *
        transform : Transform -> unit
Parameters
hostElement Element
 A structural element that will host the Fabric Sheet. The element must support fabric hosting.
transform Transform
 The transform that defines the placement of the instance single Fabric Sheet.
Exceptions
Exception | Condition
ArgumentException |  The host Element is not a valid host for Fabric Sheet. -or- transform defines the placement out of the host.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  transform is not conformal.
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace